docs/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My thoughts</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">My thoughts</h1>
</header><p>
Hi, my name is <b>Adil</b>.  This is my website with my blog posts.  I will mostly write about <code>GNU Emacs</code>, <code>general programming</code>, <code>computer graphics</code> and maybe <code>math</code>.
</p>

<p>
Unfortunately, this website doesn't have <code>comments</code> section by now.  If you have questions or want to contact me, visit this <a href="./contacts.html">page</a>.
</p>

<div id="outline-container-org01b8702" class="outline-2">
<h2 id="org01b8702">All posts</h2>
<div class="outline-text-2" id="text-org01b8702">
</div>
<div id="outline-container-org1600f3f" class="outline-3">
<h3 id="org1600f3f">2023</h3>
<div class="outline-text-3" id="text-org1600f3f">
<ul class="org-ul">
<li><a href="./why-i-switched-back-from-elpaca.html">Why I switched back from elpaca</a></li>
<li><a href="./dabbrev-is-superior.html">dabbrev is superior</a></li>
<li><a href="./computing-gcd-of-n-polynomials.html">Computing Greatest Common Divisor of N polynomials</a></li>
<li><a href="./on-barycentric-coordinates.html">On barycentric coordinates</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>